{"chart":{"trigger_month":"2023-10","assessment_date":"2025-10-27"},"phase":"stabilization","anchors":{"worst_month":"2023-12","main_trigger":"Chronic stress & perimenopause (ongoing)","onset_window":"2024-07 to 2024-09","regrowth_start":"2024-08","stabilization_by":"2024-07","stabilization_window":"2024-04 to 2024-07"},"timeline_html":"<p><strong>Summary.</strong> Sommer has experienced shedding that comes in waves for over a year, overlapping with several ongoing hormonal, lifestyle, and stress factors. She’s already seen some baby hairs returning, showing her scalp is trying to recover. 🌱</p><p><strong>Your hair-loss triggers.</strong></p><ul><li>Major illness with fever (resolved; Oct 2023)</li><li>Started or stopped birth control / hormonal treatment (ongoing; started date not provided)</li><li>Menopause or perimenopause symptoms (ongoing; started date not provided)</li><li>Chronic stress (ongoing; started date not provided)</li><li>Rapid weight loss / restrictive dieting (ongoing; started date not provided)</li><li>Over-exercising (ongoing; started date not provided)</li></ul><p><strong>Timeline forecast.</strong> The shedding likely reached its worst around Dec 2023–Jan 2024 after the October illness, then gradually calmed through mid‑2024. With multiple ongoing metabolic and hormonal stresses, stabilization likely extends through late 2024, with visible regrowth improving through early 2025. <span>Dominant driver:</span> the combination of chronic stress, restrictive dieting, and perimenopause—all ongoing—continues to influence shedding, while the illness episode set the initial wave that matched the onset timing. These ongoing factors may delay full stabilization slightly.</p><p><strong>Where you are now.</strong> You appear to be in the <em>stabilization</em> phase—shedding is less extreme, and regrowth is underway but still balancing against ongoing stress and hormonal shifts. Keep nurturing your recovery habits; steady routines and nutrition will help new growth strengthen month by month. 🌱</p>"}