{"chart":{"trigger_month":"1994-12","assessment_date":"2026-01-17"},"phase":"stabilization","anchors":{"worst_month":"2019-06","main_trigger":"Chronic stress and hormonal changes (ongoing)","onset_window":"2024-10 to 2024-12","regrowth_start":"2020-03","stabilization_by":"2020-01","stabilization_window":"2019-10 to 2020-01"},"timeline_html":"<p><strong>Summary.</strong> Pietra’s shedding has been ongoing for well over a year and still feels as if it’s worsening. Several health and hormonal shifts have overlapped with long‑term stress, making it tricky to pinpoint one simple cause.</p><p><strong>Your hair-loss triggers.</strong></p><ul><li>Chronic stress (ongoing; started Dec 1994)</li><li>Chronic illness flare (ongoing; started Jun 1995)</li><li>Medication change (ongoing; started Jun 1995)</li><li>Started or stopped hormonal treatment (resolved; Jul 1983–Aug 2024)</li><li>Menopause symptoms (ongoing; started Jan 2024)</li><li>Major illness with fever (resolved; Apr 2019)</li><li>Surgery or hospitalization (resolved; Jul 2016)</li><li>Major emotional stress (resolved; Mar 1995–Feb 1996)</li></ul><p><strong>Timeline forecast.</strong> The 2019 illness likely caused a temporary surge in shedding that peaked around Jun–Jul 2019 and eased by late 2019. However, chronic stress and ongoing hormonal and medication factors have kept follicles under strain. Based on the lag of that illness event, stabilization would typically occur by late 2019–early 2020, with regrowth expected a few months later—but the continuing stress and hormonal changes may delay this timeline. <span>Dominant driver:</span> persistent chronic stress and hormonal imbalance since the mid‑1990s, reinforced by a recent hormone withdrawal in 2024, which aligns with the ongoing pattern of diffuse thinning.</p><p><strong>Where you are now.</strong> You’re in the stabilization phase—shedding remains elevated but the worst peaks are behind you. As stress and hormone balance improve, regrowth potential returns. With consistent support and calmer routines, new baby hairs can still emerge in the months ahead. 🌱</p>"}