{"week3":{"practice1_html":"<section class=\"practice\"> \n<div class=\"big-domino\"> \n<p>Toby, your shedding waves plus ongoing thyroid/medication stress suggest you’re stuck between peak and stabilization. Right now your system is burning through protein and iron, but you’re only getting one solid protein meal a day. A steady, anti‑inflammatory breakfast gives your follicles a clear early signal: “nutrients and safety are here.” This one keystone shifts your body from crisis‑mode into the repair chemistry that shortens the lag before regrowth starts. 🌱</p> \n</div> \n\n<div class=\"what-to-do\"> \n<h4>What to do</h4> \n<ul> \n<li>Eat 25–30 g protein within 60 minutes of waking.</li> \n<li>Choose low‑sugar, anti‑inflammatory bases (greens, oats, eggs, chia, Greek yogurt, tofu).</li> \n<li>Rotate vegan and omnivore options to keep it fun and reduce food fatigue.</li> \n<li>Add a small dose of healthy fats (avocado, olive oil, nuts, flax) for hormone support.</li> \n<li>Hydrate alongside breakfast (1 glass water or herbal tea) before caffeine.</li> \n</ul> \n</div> \n\n<div class=\"practice-plan\"> \n<h4>Your plan</h4> \n<ul> \n<li><strong>Omnivore Quickie:</strong> 2 scrambled eggs + smoked salmon + spinach.</li> \n<li><strong>Vegan Power:</strong> Chia pudding with soy protein powder, berries, and almond butter.</li> \n<li><strong>Fast Smoothie:</strong> Greek yogurt or pea-protein base + frozen banana + greens + flaxseed.</li> \n<li><strong>Iron boost add‑ons:</strong> Pair with vitamin C (kiwi, orange, bell pepper) to aid absorption given your history of low iron.</li> \n</ul> \n</div> \n\n<div class=\"steps\"> \n<h4>Step-by-step implementation</h4> \n<ol> \n<li>Plan 3 breakfast combos you like—write them on a sticky note by the kettle.</li> \n<li>Prep ingredients in the evening (soaked oats, chopped fruit, greens ready).</li> \n<li>Place caffeine 30–45 min after breakfast so protein hits your system first.</li> \n<li>If stress/anxiety spikes in the morning, combine cooking with 2 min deep breathing—anchors cortisol down.</li> \n<li>On hectic mornings, take portable options (chia jar, boiled eggs, tofu wrap) so you never skip.</li> \n</ol> \n</div> \n\n<div class=\"why-it-works\"> \n<h4>Why this works (for you)</h4> \n<ul> \n<li>Your high daily stress + thyroid meds keep cortisol elevated; early protein steadies blood sugar, which flattens those morning cortisol spikes that push follicles into resting phase.</li> \n<li>Low iron history + irregular cycles suggest higher nutrient demand; pairing iron‑rich breakfast foods with vitamin C improves absorption right when your body is most primed.</li> \n<li>Your shedding waves began ~6 months ago, matching trigger timing; nutrient‑anchored mornings shorten the stabilization window so regrowth can begin on schedule.</li> \n<li>Fun, quick options remove decision fatigue—critical since anxiety can make mornings overwhelming.</li> \n</ul> \n</div> \n\n<div class=\"watch-outs\"> \n<h4>What to look out for</h4> \n<ul> \n<li><strong>Red flags:</strong> Skipping breakfast or relying on only carbs → can spike cortisol, worsen waves; if it happens often, gently reset with a smoothie the next day.</li> \n<li><strong>Green lights:</strong> Within 1–2 weeks you’ll notice fewer 10am crashes, steadier mood, and improved bowel regularity—early systemic signs shedding will soon calm.</li> \n<li>Remember ❤️: hair recovery is a marathon. Each breakfast is a signal of safety. Even on anxious mornings, one small protein choice counts.</li> \n</ul> \n</div> \n</section>","practice2_html":"<section class=\"practice\"> <div class=\"big-domino\"> <p>Toby, your shedding has been stuck in “waves” with no baby hairs yet—classic of still being in the <strong>peak/stabilization border</strong>. Because you have a history of low iron, irregular cycles, chronic illness, and protein-light meals, your follicles may simply lack enough iron and protein to move into regrowth. This is the Big Domino: get your “iron fuel” steady, so your body has the raw material to shift from hanging onto stress-shed into sprouting new hairs. 🌱</p> </div> <div class=\"what-to-do\"> <h4>What to do</h4> <ul> <li>Build an “iron anchor meal” once a day with both heme iron (chicken, beef, turkey, salmon) + vitamin C (pepper, orange, berries).</li> <li>Aim for 20–30 g protein in at least 2 meals daily to carry the iron into keratin-making.</li> <li>Keep tea/coffee 1–2 hrs away from that anchor meal (they block absorption).</li> <li>Pair plant sources (lentils, beans, spinach) with vitamin C to “unlock” their iron.</li> </ul> </div> <div class=\"practice-plan\"> <h4>Your plan</h4> <ul> <li>Pick one consistent meal (lunch or dinner) as your Popeye meal.</li> <li>Add one palm-sized protein + a colorful vitamin C veg/fruit.</li> <li>Shift caffeine to mornings only, so your anchor meal stays clear.</li> <li>Notice mood swings or PMS flares—those suggest iron swings; use the meal to buffer.</li> </ul> </div> <div class=\"steps\"> <h4>Step-by-step implementation</h4> <ol> <li>Look at tomorrow’s lunch/dinner—decide which will be your Popeye meal this week.</li> <li>Shop/stock one easy iron protein (rotisserie chicken strips, canned salmon, lean beef) + one vitamin C booster.</li> <li>Block caffeine: only before noon. Keep afternoon tea 2 hrs away from your iron anchor.</li> <li>Track with a simple note: “Did I do my Popeye meal today?”—no calorie counting needed.</li> <li>If stress flares, use meal prep as grounding—chop veg, breathe, remember: fueling follicles is calming as well as nourishing.</li> </ol> </div> <div class=\"why-it-works\"> <h4>Why this works (for you)</h4> <ul> <li>Your shedding waves match an ongoing chronic illness + med change. Nourishing iron/protein doesn’t remove the trigger but prevents extra hairs from slipping into telogen.</li> <li>You’ve had low iron before + irregular cycles → consistent with iron demand higher than supply. This closes the gap.</li> <li>PMS + stress raise cortisol; caffeine later than noon + tea with meals would block iron, prolonging lag. Adjusting timing accelerates stabilization.</li> <li>This makes regrowth likely closer to its natural window instead of being delayed by nutrient shortfall.</li> </ul> </div> <div class=\"watch-outs\"> <h4>What to look out for</h4> <ul> <li><strong>Red flags:</strong> Feeling more exhausted, dizzy, or short of breath despite Popeye meals → flag to your clinician, as diet alone may not replete iron.</li> <li><strong>Green lights:</strong> Within 10–14 days, steadier energy through the afternoon; PMS symptoms softening; shedding waves start to shorten in length.</li> <li>Remember, Toby—this is not perfection. One consistent meal can be enough to flip your follicles’ signal toward regrowth. ❤️</li> </ul> </div> </section>","practice3_html":"<section class=\"practice\"> \n<div class=\"big-domino\"> \n<p>Your shedding is still in “waves,” which suggests you’re in the late peak / early stabilization window after months of stress, thyroid shifts, and med changes. Right now your hair needs steady fuel to quiet cortisol and begin the regrowth phase. Adding the right fats—especially omega‑3s—can be the single domino that calms inflammation from your ongoing illness and gives follicles the raw building blocks for repair. 🌱</p> \n</div> \n<div class=\"what-to-do\"> \n<h4>What to do</h4> \n<ul> \n<li>Eat fatty fish (salmon, sardines, mackerel) 2x per week or use a fresh algae oil for plant‑based omega‑3.</li> \n<li>Check labels: aim for at least 500 mg combined EPA+DHA daily for hair and hormone support.</li> \n<li>Store oils cold and dark; toss if they smell fishy or rancid (oxidized oils = stress on the body).</li> \n<li>Balance by limiting deep‑fried or processed seed oils that drive more inflammation.</li> \n</ul> \n</div> \n<div class=\"practice-plan\"> \n<h4>Your plan</h4> \n<ul> \n<li>Target: one omega‑3 source every day this week (fish, walnuts, chia, flax, or supplement).</li> \n<li>Pair fats with protein—since you often get only one high‑protein meal, add eggs, Greek yogurt, or beans to spread intake.</li> \n<li>Evening meal: keep it lighter on fried/heavy oils, since you eat close to bedtime and this helps sleep quality.</li> \n</ul> \n</div> \n<div class=\"steps\"> \n<h4>Step-by-step implementation</h4> \n<ol> \n<li>Pick 2 fish dinners this week and add greens or lentils for iron synergy.</li> \n<li>On non‑fish days, sprinkle chia or flax into breakfast or smoothie.</li> \n<li>If considering a supplement, choose a small dose algae/fish oil with meals and store in fridge.</li> \n<li>Replace at least one fried/fast food meal with baked or grilled protein and avocado/olive oil.</li> \n<li>Notice how calmer digestion and steadier energy feel after 7–10 days—this is your body lowering inflammation so follicles can exit “shed mode.”</li> \n</ol> \n</div> \n<div class=\"why-it-works\"> \n<h4>Why this works (for you)</h4> \n<ul> \n<li>Your chronic thyroid/illness flares keep inflammation higher; omega‑3s buffer cortisol surges and support calmer immune signaling, reducing ongoing “waves” of shedding.</li> \n<li>Because you get protein only once daily, pairing more good fats with broader protein intake helps hair shafts rebuild sooner and prevents lag into the next cycle.</li> \n<li>Shedding that peaked with med changes (Mar–Apr) is due to stabilize now; fats accelerate that stabilization so regrowth can start by winter instead of dragging out.</li> \n<li>Irregular cycles and possible low iron raise hair stress; omega‑3s also steady PMS‑linked inflammation, making it easier for follicles to hold onto strands.</li> \n</ul> \n</div> \n<div class=\"watch-outs\"> \n<h4>What to look out for</h4> \n<ul> \n<li><strong>Red flags:</strong> Burping or stomach upset from oil → switch to algae-based or split smaller doses.</li> \n<li><strong>Green lights:</strong> Within 10–14 days you feel less scalp itch/irritation, skin more supple, energy steadier.</li> \n<li><strong>Green lights:</strong> In 4–6 weeks, notice fewer “big shed days” even if some waves remain.</li> \n<li>❤️ Remember: this isn’t about perfection. Each smoother week nourishes your follicles closer to the regrowth phase.</li> \n</ul> \n</div> \n</section>","practice1_title":"Practice 1: Win Your Day with Breakfast","practice2_title":"Practice 2: The Popeye Protocol","practice3_title":"Practice 3: Eat More Good Fats"}}
