{"week2":{"practice1_html":"<section class=\"practice\">\n  <div class=\"big-domino\">\n    <p>Toby, your shedding is still in the “peak” window—>200 hairs daily—with sleep running under 5h and ongoing stress from both fever illness and anxiety/rumination. That combo keeps cortisol high at night, which delays stabilization. Mental Resilience Training is your big domino because calming your nervous system before bed is what lets follicles shift out of telogen sooner and sets you up for regrowth 🌙.</p>\n  </div>\n  <div class=\"what-to-do\">\n    <h4>What to do</h4>\n    <ul>\n      <li>Set aside 10 min nightly for simple practice (no phone, no scrolling).</li>\n      <li>Use a guided Yoga Nidra or body-scan audio—headphones in bed are fine.</li>\n      <li>Pair with 4–6 slow breaths per minute to downshift your heart rate.</li>\n      <li>Morning: step outside for natural light, even 5 min, to anchor circadian rhythm.</li>\n    </ul>\n  </div>\n  <div class=\"practice-plan\">\n    <h4>Your plan</h4>\n    <ul>\n      <li>Nightly: Yoga Nidra or 4-7-8 breathing, 10–12 minutes before sleep.</li>\n      <li>Daytime: 1–2 micro-breaks with box breathing (inhale 4, hold 4, exhale 4, hold 4).</li>\n      <li>Replace late-night doom scrolling with a short “mental note list” → park worries until tomorrow.</li>\n    </ul>\n  </div>\n  <div class=\"steps\">\n    <h4>Step-by-step implementation</h4>\n    <ol>\n      <li>Pick a 10–15 min window before bed, same time each night.</li>\n      <li>Put your phone on airplane or do-not-disturb; open your audio track first.</li>\n      <li>Lie down, place one hand on belly, one on chest. Follow the breathing pace.</li>\n      <li>If thoughts race, silently repeat “release” with each exhale.</li>\n      <li>In the morning, step outdoors within 30 min of waking—even a balcony helps set your clock.</li>\n    </ol>\n  </div>\n  <div class=\"why-it-works\">\n    <h4>Why this works (for you)</h4>\n    <ul>\n      <li>Because your shedding is still worsening, nightly nervous system downshift lowers cortisol surges that keep pushing follicles into telogen.</li>\n      <li>Your illness trigger (early Sept) is ongoing; calming stress response buffers extra loss while your body recovers.</li>\n      <li>Morning light + steadier bedtime improves sleep quality, even if total hours stay short, which improves repair signals for regrowth 🌱.</li>\n      <li>Replacing doom scrolling with structured practice stops late-night stimulation that fragments your already fragile sleep.</li>\n    </ul>\n  </div>\n  <div class=\"watch-outs\">\n    <h4>What to look out for</h4>\n    <ul>\n      <li><strong>Red flags:</strong> If your bedtime practice starts to feel like another “task” that stresses you → scale it down to 3 min breathing instead of dropping it completely.</li>\n      <li><strong>Green lights:</strong> Within 7–10 days you may notice falling asleep faster, fewer 2–3 a.m. wakings, or slightly less morning fatigue.</li>\n      <li>And remember ❤️—it’s not about being perfect. Even small, steady cues to your nervous system move you toward stabilization and open the door to regrowth.</li>\n    </ul>\n  </div>\n</section>","practice2_html":"<section class=\"practice\"> \n<div class=\"big-domino\"> \n<p>Toby, your shedding is still in the worsening phase, right on the lag from July over‑exercise and September illness. The “big domino” here is hormonal steadiness: your irregular cycles + very short sleep (<5h, late caffeine, night wakings) suggest cortisol is spiking and disrupting ovarian signals. By stabilizing your daily rhythm now, you shorten the time to stabilization and smooth the path toward regrowth. 🌙</p> \n</div> \n<div class=\"what-to-do\"> \n<h4>What to do</h4> \n<ul> \n<li>Fix bedtime/wake so hormones follow a predictable curve.</li> \n<li>Limit caffeine to before 1 pm to reduce night cortisol.</li> \n<li>Morning light within 30 min of wake: circadian anchor → steadier progesterone & thyroid tone.</li> \n<li>Protein with breakfast (20–30 g) to give raw material for hormones + follicles.</li> \n</ul> \n</div> \n<div class=\"sleep-schedule\"> \n<h4>Your recommended schedule</h4> \n<ul> \n<li>Wake: 7:00 am (anchor daily, even weekends).</li> \n<li>Bed: lights out 11:00 pm → aim 8 h window.</li> \n<li>No caffeine after 1:00 pm; last meal ≥2 h before bed.</li> \n</ul> \n</div> \n<div class=\"steps\"> \n<h4>Step-by-step implementation</h4> \n<ol> \n<li>Set a fixed morning alarm at 7:00 am, regardless of bedtime.</li> \n<li>Get outside (or near bright window) for 10–15 min light exposure immediately on waking.</li> \n<li>Front‑load your hardest mental/physical tasks before mid‑afternoon so cortisol follows its natural curve.</li> \n<li>Replace doom‑scroll bedtime habit with a 10‑min audiobook or calming stretch—same cue, lower cortisol.</li> \n<li>Build balanced plate at breakfast: eggs/Greek yogurt or plant protein + fruit/grain for ~25 g protein.</li> \n</ol> \n</div> \n<div class=\"why-it-works\"> \n<h4>Why this works (for you)</h4> \n<ul> \n<li>Because sleep <5h + late caffeine keeps cortisol elevated at night, fixing your wake anchor resets circadian hormones → fewer hairs pushed into telogen.</li> \n<li>Your irregular cycles suggest luteal hormone wobble; deeper sleep allows steadier progesterone, easing shedding pressure.</li> \n<li>Triggers from July/Sept created a lag; this routine compresses the stabilization window so you reach regrowth sooner.</li> \n<li>Protein at breakfast supports both hormone synthesis and follicle regrowth substrate.</li> \n</ul> \n</div> \n<div class=\"watch-outs\"> \n<h4>What to look out for</h4> \n<ul> \n<li><strong>Red flags:</strong> If insomnia worsens or cycles become absent for 3+ months → check in with a clinician.</li> \n<li><strong>Green lights:</strong> Within 1–2 weeks, you’ll notice waking easier at 7 am, calmer evenings, and slightly fewer 2 am wakings.</li> \n<li>Remember: shedding lag feels scary now, but each consistent night moves you closer to stabilization. You are not stuck ❤️</li> \n</ul> \n</div> \n</section>","practice3_html":"<section class=\"practice\"> \n<div class=\"big-domino\"> \n<p>Toby, your shedding is still in the worsening phase (<5 hours sleep, night wakings, post-illness stress load). Right now your body is stuck in peak telogen. Becoming a “Professional Sleeper” is your big domino because it tames the overstimulated cortisol rhythm from illness + overtraining, nudges you into stabilization, and sets the stage for regrowth signals to show on time. 🌙✨</p> \n</div> \n<div class=\"what-to-do\"> \n<h4>What to do</h4> \n<ul> \n<li>Fix a steady wake-up time daily (anchor for circadian rhythm).</li> \n<li>Expose eyes to outdoor light within 30 minutes of waking.</li> \n<li>Protect an 8-hour sleep opportunity window (bed/wake math).</li> \n<li>Keep your bedroom dark, cool, and device-free after lights out.</li> \n<li>If you wake at night, use slow breathing or 3-min body scan instead of doom-scrolling.</li> \n</ul> \n</div> \n<div class=\"sleep-schedule\"> \n<h4>Your recommended schedule</h4> \n<ul> \n<li>Wake: 7:00 am ±15 min (all 7 days).</li> \n<li>Bed window: 11:00 pm → 7:00 am target.</li> \n<li>Morning light: between 7:00–7:45 am outdoors, even cloudy.</li> \n</ul> \n</div> \n<div class=\"steps\"> \n<h4>Step-by-step implementation</h4> \n<ol> \n<li>Pick 7:00 am as your non-negotiable wake anchor—even on weekends.</li> \n<li>Step outside for 5–10 min without sunglasses soon after waking.</li> \n<li>Block your calendar so screens go dark after 10:30 pm; prep the room cool, quiet, dark.</li> \n<li>Use breathing or grounding if you wake at night instead of reaching for your phone.</li> \n<li>If you only manage 6 hours at first, honor the anchor and let the body consolidate deeper sleep over weeks.</li> \n</ol> \n</div> \n<div class=\"why-it-works\"> \n<h4>Why this works (for you)</h4> \n<ul> \n<li>Because your illness is still ongoing, steady sleep anchors lower night cortisol surges → fewer hairs pushed into telogen.</li> \n<li>Morning light + fixed wake strengthens circadian rhythm, stabilizing shedding curve so regrowth can begin on its normal 2–3 month lag.</li> \n<li>Deep sleep pulses growth hormone, which supports follicle recovery and protein repair—important since you hit only 1 protein-rich meal daily.</li> \n<li>Less night-time doom scrolling = lower anxiety load, more consolidated slow-wave sleep, calmer cycles even with irregular periods.</li> \n</ul> \n</div> \n<div class=\"watch-outs\"> \n<h4>What to look out for</h4> \n<ul> \n<li><strong>Red flags:</strong> If you stay under 5 hrs consistently, shedding likely stays unstable → gently extend by 15 min per week until you hit 7–8 hrs.</li> \n<li><strong>Green lights:</strong> Fewer middle-of-night wakings within 7–10 days; less morning grogginess; shedding starting to plateau by 6–8 weeks.</li> \n<li>❤️ Remember: your body heals fastest in rhythm, not perfection—consistency is power, not all-nighters.</li> \n</ul> \n</div> \n</section>","practice1_title":"Practice 1: Mental Resilience Training","practice2_title":"Practice 2: Mental Resilience Training","practice3_title":"Practice 3: Professional Sleeper"}}