{"week2":{"practice1_html":"<section class=\"practice\">\n  <h3>What it is</h3>\n  <p>Mental Resilience Training is a simple daily practice that uses breathing or guided relaxation to calm your nervous system, so stress doesn’t keep your body stuck in overdrive.</p>\n\n  <h3>Why this practice matters for you now</h3>\n  <p>Elena, you’re in the peak shedding phase, and your ongoing chronic illness flare plus the emotional stress you’ve been carrying are keeping hair fall intense. Building resilience through calming breathwork is your “big domino” right now—when your stress response steadies, your body can move closer to stabilization and prepare for regrowth. This is the bridge from overwhelm to healing.</p>\n\n  <h3>Step-by-step implementation</h3>\n  <ol>\n    <li>Choose a consistent time—either right after waking or before bed.</li>\n    <li>Sit or lie comfortably, close your eyes, and place one hand on your belly.</li>\n    <li>Breathe in slowly through your nose for a count of 4, feel your belly rise; exhale through your mouth for a count of 6.</li>\n    <li>Repeat for 5 minutes to start, gradually adding 1–2 minutes each week.</li>\n    <li>Optional: If your mind races, play a short guided yoga nidra or body-scan meditation.</li>\n  </ol>\n\n  <h3>What to look for</h3>\n  <ul>\n    <li><strong>Early wins:</strong> Fewer middle-of-the-night wakeups, feeling calmer during stressful moments, easier wind-down before sleep.</li>\n    <li><strong>Watch-outs:</strong> Your go-to coping method is doom scrolling—try swapping even 5 minutes of phone scrolling for your breathing practice. If the urge hits, set a timer, finish your breath cycle, then check your phone.</li>\n    <li>Consistency builds momentum—one steady breath at a time, you’re creating the conditions your body needs to release this peak shedding. 🌱</li>\n  </ul>\n</section>","practice2_html":"<section class=\"practice\">\n  <h3>What it is</h3>\n  <p>Hormonal Health Boost helps you gently support balance in your cycle and energy rhythms, so your body isn’t working against your hair — it’s working with it.</p>\n\n  <h3>Why this practice matters for you now</h3>\n  <p>Elena, you’re in the peak shedding phase, and with irregular cycles plus high stress, your hormones are under extra strain. This step is your “big domino” because steadying hormonal signals reduces the constant alarm your follicles are feeling. Supporting this now moves you toward stabilization, so by spring your scalp can finally shift from shedding to signs of regrowth. 🌱</p>\n\n  <h3>Step-by-step implementation</h3>\n  <ol>\n    <li><strong>Anchor protein:</strong> Aim for 20–30g of protein at breakfast to stabilize blood sugar and hormone signaling through the day.</li>\n    <li><strong>Cycle check-in:</strong> Note your period dates, flow, and PMS moods in a simple tracker — awareness is the first lever for balance.</li>\n    <li><strong>Stress swap:</strong> Each evening, replace 5 minutes of doom scrolling with slow belly breathing; this directly quiets stress hormones.</li>\n    <li><strong>Evening wind-down:</strong> Set screens aside 30 minutes before bed and switch to dim, warm light to cue melatonin release.</li>\n  </ol>\n\n  <h3>What to look for</h3>\n  <ul>\n    <li><strong>Early wins:</strong> Less extreme PMS shifts, steadier mid-day energy, or waking feeling slightly more refreshed within 1–2 weeks.</li>\n    <li><strong>Watch-outs:</strong> Scrolling late at night can spike stress and disrupt sleep; instead, keep your phone charging across the room.</li>\n    <li>Consistency builds momentum — and each small hormone-friendly choice helps nudge your follicles back toward growth. You’re laying the foundation one day at a time. 🌿</li>\n  </ul>\n</section>","practice3_html":"<section class=\"practice\"> \n  <h3>What it is</h3> \n  <p>Professional Sleeper is about upgrading the quality of the hours you already spend in bed, so the sleep you do get restores your body more deeply and steadies your hair cycle at its roots.</p> \n  \n  <h3>Why this practice matters for you now</h3> \n  <p>Elena, you are in the peak shedding phase, with high stress and broken sleep stealing recovery from your body each night. Right now, the biggest domino is learning to sleep more professionally — because when your nervous system gets those deeper cycles, it shifts you closer to stabilization and clears the ground for regrowth to begin. This practice helps counter both stress and chronic illness strain at the same time.</p> \n  \n  <h3>Step-by-step implementation</h3> \n  <ol> \n    <li>Expose your eyes to natural morning light within 30 minutes of waking (step outside for 5 minutes if possible).</li> \n    <li>Keep your bedroom as cool and dark as you can — even a small drop in temperature signals your body to sink deeper into rest.</li> \n    <li>Reserve your bed strictly for sleep — no scrolling, emails, or TV once you’re under the covers.</li> \n    <li>If you wake up restless, instead of lying in frustration, sit in dim light and read a calming book until you naturally feel sleepy again.</li> \n  </ol> \n  \n  <h3>What to look for</h3> \n  <ul> \n    <li><strong>Early wins:</strong> Falling back asleep more quickly after night wakings, feeling less groggy within 20–30 minutes of rising, or noticing your mood steadies during the day.</li> \n    <li><strong>Watch-outs:</strong> Doom scrolling late at night can erode the progress here. Quick fix: plug in your phone across the room and keep a paperback nearby instead.</li> \n    <li>Consistency builds momentum — one restorative night at a time. 🌱</li> \n  </ul> \n</section>","practice1_title":"Practice 1: Mental Resilience Training","practice2_title":"Practice 2: Mental Resilience Training","practice3_title":"Practice 3: Professional Sleeper"}}