{"week2":{"practice1_html":"<section class=\"practice\">\n  <h3>What it is</h3>\n  <p>Mental Resilience Training is a simple daily practice of calming your mind with breathwork or short guided rest exercises, so stress no longer keeps your body in overdrive.</p>\n  \n  <h3>Why this practice matters for you now</h3>\n  <p>You’re in the stabilization phase — your shedding has leveled and baby hairs are already returning. But with chronic stress still present, your progress can stall. Anchoring a few minutes of deep, nervous‑system reset each day is your “big domino”: it keeps cortisol from spiking, protects fragile new hairs, and helps carry you smoothly toward visible regrowth.</p>\n  \n  <h3>Step-by-step implementation</h3>\n  <ol>\n    <li>Choose a quiet spot once a day (morning or before bed works best).</li>\n    <li>Close your eyes, place one hand on your belly, and inhale deeply for 4 counts, exhale slowly for 6 counts. Repeat for 2 minutes.</li>\n    <li>When thoughts race, gently return focus to the breath — no judgment, just start again.</li>\n    <li>If you want extra support, try a 10‑minute yoga nidra or guided breathing app once or twice per week.</li>\n  </ol>\n  \n  <h3>What to look for</h3>\n  <ul>\n    <li><strong>Early wins:</strong> Deeper sleep within a week, fewer middle-of-the-night wakeups, and a calmer baseline mood during the day.</li>\n    <li><strong>Watch-outs:</strong> Late caffeine after 3 pm makes it harder to feel benefits; swap to herbal tea to protect your results.</li>\n    <li>Consistency builds momentum — one steady breath at a time, you’re training your body to feel safe enough to grow again. 🌱</li>\n  </ul>\n</section>","practice2_html":"<section class=\"practice\">\n  <h3>What it is</h3>\n  <p>The Self-Sabotage Buster helps you replace stress habits that quietly chip away at your hair health with ones that uplift you — so your body is freed up to keep fueling regrowth.</p>\n\n  <h3>Why this practice matters for you now</h3>\n  <p>You’re in the stabilization phase, which means your shedding has steadied and baby hairs are already showing. The main block is ongoing stress and how it’s being soothed — right now, alcohol is stepping in when stress runs high. Swapping this coping style is your “big domino”: it lowers stress hormone swings that can stall regrowth and sets you up for a smoother lift into the regrowth phase ahead.</p>\n\n  <h3>Step-by-step implementation</h3>\n  <ol>\n    <li>Pick one daily “swap moment” — for example, the time you’d usually reach for a glass of wine after work.</li>\n    <li>Choose a calming replacement in advance (herbal tea, journaling, a short walk, or even a podcast that shifts your focus).</li>\n    <li>Set a 5-minute rule: give your swap a try for five minutes before deciding if you still want the drink.</li>\n    <li>Track each successful swap on paper or in your phone — celebrate every notch; change builds with repetition.</li>\n  </ol>\n\n  <h3>What to look for</h3>\n  <ul>\n    <li><strong>Early wins:</strong> Fewer “stress hangovers” the next morning, more even mood at night, and less disrupted sleep within a week or two.</li>\n    <li><strong>Watch-outs:</strong> Defaulting to “just tonight” with alcohol after late work. Quick fix: keep your swap option prepped before you clock out.</li>\n    <li>Consistency builds momentum — every stress swap you make is a direct signal to your body: safety is here, it’s okay to keep growing. 🌱</li>\n  </ul>\n</section>","practice3_html":"<section class=\"practice\">\n  <h3>What it is</h3>\n  <p>Hormonal Health Boost helps you tune into your body’s natural rhythms and steady out swings that quietly drive shedding. Simple daily tweaks can bring more balance, so your follicles feel safer to stay in growth mode.</p>\n  \n  <h3>Why this practice matters for you now</h3>\n  <p>You’re in the stabilization phase, Toby — shedding has leveled, and new growth is peeking through. But irregular cycles paired with ongoing stress can nudge hormones off balance, keeping your follicles on edge. This practice is your big domino: supporting steadier hormones now makes shedding settle further, clears the path for thicker regrowth, and helps your body move confidently into its next healing stage.</p>\n  \n  <h3>Step-by-step implementation</h3>\n  <ol>\n    <li>Anchor protein: Aim for at least one hormone-friendly protein meal (20–30g) before midday.</li>\n    <li>Steady your cycle: Track your period start and length for at least 2 months so patterns are clear.</li>\n    <li>Choose a swap: Replace 2–3 alcohol nights per week with a calming ritual like warm tea or journaling.</li>\n    <li>Support sleep: Set caffeine cutoff at 2 pm to reduce night wakings and allow your body’s repair hormones to rise.</li>\n    <li>Add color: Include one extra serving of leafy greens each day to give your liver nutrients it uses to process hormones.</li>\n  </ol>\n  \n  <h3>What to look for</h3>\n  <ul>\n    <li><strong>Early wins:</strong> Feeling slightly calmer by bedtime, fewer 2–3 a.m. wakeups, and steadier energy through late afternoon.</li>\n    <li><strong>Watch-outs:</strong> Leaning on alcohol to unwind — quick fix: prep a non-alcohol ritual before evening so you have it ready at the time you usually pour a drink.</li>\n    <li>Consistency builds trust in your body — each small choice is a signal of safety for your hair. 🌱</li>\n  </ul>\n</section>","practice1_title":"Practice 1: Mental Resilience Training","practice2_title":"Practice 2: Mental Resilience Training","practice3_title":"Practice 3: Hormonal Health Boost"}}