{"week2":{"practice1_html":"<section class=\"practice\"> \n<div class=\"big-domino\"> \n<p>Jeanne, your shedding has peaked and is now sitting in a stable phase. What’s still pressing on the “pause button” for regrowth is ongoing emotional stress paired with restless nights (2–3 awakenings, late caffeine, alcohol). The big domino now is teaching your nervous system to downshift fast—so cortisol stops pushing hairs into holding pattern and you can move from stability toward regrowth. 🌱</p> \n</div> \n\n<div class=\"what-to-do\"> \n<h4>What to do</h4> \n<ul> \n<li>Practice a short guided body scan or yoga nidra before bed, 10–15 min.</li> \n<li>Use 4-7-8 breathing anytime afternoon stress spikes.</li> \n<li>Anchor your wind-down by lying down then placing one hand on your belly, one on your chest; breathe slow until the chest hand barely moves.</li> \n<li>On alcohol nights, double down on 5 min of breathwork to buffer cortisol before sleep.</li> \n</ul> \n</div> \n\n<div class=\"practice-plan\"> \n<h4>Your plan</h4> \n<ul> \n<li>Evenings: 10–15 min audio-guided yoga nidra or body scan in bed.</li> \n<li>Afternoon: 2 rounds of 4-7-8 breathing when feeling anxious.</li> \n<li>Stressful days: repeat 5 breaths with hands-on-belly to settle before meals (less emotional eating, steadier blood sugar).</li> \n</ul> \n</div> \n\n<div class=\"steps\"> \n<h4>Step-by-step implementation</h4> \n<ol> \n<li>After dinner, avoid late caffeine; switch to herbal tea.</li> \n<li>Set phone alarm at ~9:30 pm: cue to dim lights and start wind-down.</li> \n<li>Lie down, press play on a short guided nidra (YouTube/podcasts are fine and free).</li> \n<li>Practice 4-7-8 breathing at least once in the late afternoon slump (instead of reaching for sugar).</li> \n<li>On nights after alcohol, extend the breathing to 2–3 cycles before bed to soften extra cortisol release.</li> \n</ol> \n</div> \n\n<div class=\"why-it-works\"> \n<h4>Why this works (for you)</h4> \n<ul> \n<li>Your stressor is still ongoing (bereavement/job stress). These practices calm the HPA axis so fewer follicles tip into telogen.</li> \n<li>Because you already stabilized after peak shedding, reducing night cortisol swings is what nudges you into regrowth start—likely within the next 2–3 months.</li> \n<li>Heavy periods suggest possible iron pressure; calmer sleep helps iron use and reduces cravings driven by stress-eating.</li> \n<li>Even with late caffeine/alcohol sometimes, consistent nightly downshift buffers the damage and preserves melatonin quality. 🌙</li> \n</ul> \n</div> \n\n<div class=\"watch-outs\"> \n<h4>What to look out for</h4> \n<ul> \n<li><strong>Red flags:</strong> If awakenings persist at 4+ times a night, or anxiety spirals keep you from sleep entirely → consider checking with a professional for sleep support.</li> \n<li><strong>Green lights:</strong> Within 7–10 days, you notice a calmer mood before bed; sugar cravings ease; you fall back asleep faster after wake-ups.</li> \n<li>❤️ Small nudge: even 5 minutes counts; perfection isn’t needed—consistency is.</li> \n</ul> \n</div> \n</section>","practice2_html":"<section class=\"practice\"> \n<div class=\"big-domino\"> \n<p>Jeanne, your shedding peaked months ago and is now holding steady—classic “stabilization.” But no baby hairs yet means your body still hasn’t flipped into regrowth. With both birth‑control changes and ongoing emotional stress in play, your hormones are juggling a lot. This practice is the big domino because balancing your cortisol and cycle signals now helps move you from “stuck stable” into “regrowth start.” 🌱</p> \n</div> \n<div class=\"what-to-do\"> \n<h4>What to do</h4> \n<ul> \n<li>Anchor your wake time within a 20‑min window daily to steady cortisol.</li> \n<li>Limit caffeine to before 2 pm; late intake fragments sleep and delays repair signals.</li> \n<li>2–3 nights per week: swap alcohol for sparkling water + magnesium‑rich snack (pumpkin seeds, almonds).</li> \n<li>Add one extra high‑protein meal (20–30g) on top of your usual daily dose—supports hormones + hair keratin.</li> \n<li>Track cycle symptoms (bleeding volume, PMS) to spot iron strain or progesterone dips.</li> \n</ul> \n</div> \n<div class=\"practice-plan\"> \n<h4>Your plan</h4> \n<ul> \n<li>Cycle log: jot flow heaviness + PMS notes each month.</li> \n<li>Protein target: breakfast or lunch—choose whichever fits routine; aim 4–5 days/week.</li> \n<li>Replace at least one alcohol night with herbal tea ritual (lemon balm, chamomile).</li> \n<li>Light anchor: 10 min outside within 1h of waking for circadian rhythm.</li> \n</ul> \n</div> \n<div class=\"steps\"> \n<h4>Step-by-step implementation</h4> \n<ol> \n<li>Pick a consistent wake time (e.g. 7:00am); keep it on weekends.</li> \n<li>Prep a protein‑rich breakfast (eggs + Greek yogurt, or smoothie with whey/pea protein).</li> \n<li>Set a phone reminder at 2pm: “last caffeine checkpoint.”</li> \n<li>Designate two “alcohol‑free nights” and replace with calming tea + journal before bed.</li> \n<li>After waking, step outside for 10 min of natural light to anchor hormones.</li> \n<li>Record cycle notes each month to observe trends in bleeding heaviness and mood—this guides iron/hormone awareness without medical labels.</li> \n</ol> \n</div> \n<div class=\"why-it-works\"> \n<h4>Why this works (for you)</h4> \n<ul> \n<li>Stress from ongoing bereavement/job trauma keeps cortisol elevated. A fixed wake time blunts evening cortisol spikes → steadier signals to hair follicles.</li> \n<li>Your hormonal change in Feb likely pushed hairs into telogen by April; you’ve stabilized, but regrowth stalls if sleep and cortisol remain jagged. This routine shortens the lag to visible baby hairs.</li> \n<li>Heavy periods suggest possible iron risk. Paired with only one protein meal/day, hair lacks raw material. Adding protein + tracking flow restores balance for regrowth.</li> \n<li>Alcohol and late caffeine disrupt deep sleep, cutting into repair hormones (growth hormone, melatonin). Your swaps protect the night window needed for regrowth start.</li> \n</ul> \n</div> \n<div class=\"watch-outs\"> \n<h4>What to look out for</h4> \n<ul> \n<li><strong>Red flags:</strong> If fatigue worsens, periods become heavier, or you see no shift in shedding by 3–4 months → bring your cycle log to a doctor.</li> \n<li><strong>Green lights:</strong> Within 2 weeks: steadier mornings, fewer 2 am wake‑ups, calmer mood swings.</li> \n<li><strong>Green lights:</strong> By 6–8 weeks: early baby hairs along hairline, or shedding ease on comb‑through.</li> \n<li>❤️ Progress feels invisible at first—trust that each calm morning, protein meal, and alcohol‑free night is quietly nudging you toward regrowth.</li> \n</ul> \n</div> \n</section>","practice3_html":null,"practice1_title":"Practice 1: Mental Resilience Training","practice2_title":"Practice 2: Mental Resilience Training","practice3_title":"Practice 3: "}}